// eslint-disable-next-line prefer-const
export let mockUsers = [
  {
    id: "1234500001",
    employeeNo: "1234500001",
    name: "กาญจนา พิเศษ",
    address:
      "46/1 หมู่ 9 หมู่บ้านนกน้อย ซอยรัชดาภิเษก 66 เขตบางซื่อ แขวงบางซื่อ กทม. 10800",
    registerDate: "16/04/2025",
  },
  {
    id: "1234500002",
    employeeNo: "1234500002",
    name: "ดวงกลม ฤทัย",
    address:
      "46/2 หมู่ 9 หมู่บ้านนกน้อย ซอยรัชดาภิเษก 66 เขตบางซื่อ แขวงบางซื่อ กทม. 10800",
    registerDate: "17/04/2025",
  },
  {
    id: "1234500003",
    employeeNo: "1234500003",
    name: "จิรายุส เกียรติคุณ",
    address:
      "46/3 หมู่ 9 หมู่บ้านนกน้อย ซอยรัชดาภิเษก 66 เขตบางซื่อ แขวงบางซื่อ กทม. 10800",
    registerDate: "18/04/2025",
  },
  {
    id: "1234500004",
    employeeNo: "1234500004",
    name: "นิพราพร โอบอ้อม",
    address: null,
    registerDate: "19/04/2025",
  },
];
